app/reflexes/category_reflex.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def change_category
    @category = Category.find element.dataset.id

UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Mudou"], ["updated_at", "2022-01-28 16:25:04.825619"], ["id", 2]]
---
  def edit_category
    @category = Category.find(element.dataset.id)
    @category.assign_attributes(category_params)
    @category.save