app/reflexes/todo_list_reflex.rb

  def delete_todo_list
    todo_list = TodoList.find element.dataset.id
    todo_list.destroy
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = $1  [["id", 1]]