app/controllers/categories_controller.rb

INSERT INTO "categories" ("user_id", "name", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "Compras"], ["position", 1], ["created_at", "2022-01-27 20:08:36.571036"], ["updated_at", "2022-01-27 20:08:36.571036"]]
---
  def create
    @category = @user.categories.build(category_params)

    if @category.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:user_id])

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_category
      @category = @user.categories.find(params[:id])