app/controllers/todo_lists_controller.rb

  def create
    @todo_list = @category.todo_lists.build(todo_list_params)

    if @todo_list.save
---
INSERT INTO "todo_lists" ("category_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 2], ["title", "Novo"], ["description", "Todo"], ["created_at", "2022-01-28 11:28:50.836043"], ["updated_at", "2022-01-28 11:28:50.836043"]]

  def destroy
    @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = $1  [["id", 10]]

    def set_category
      @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_todo_list
      @todo_list = @category.todo_lists.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."category_id" = $1 AND "todo_lists"."id" = $2 LIMIT $3  [["category_id", 2], ["id", 1], ["LIMIT", 1]]