app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Alysson"], ["email", "alysson@email.com"], ["password_digest", "32442303"], ["created_at", "2022-01-27 19:10:51.770168"], ["updated_at", "2022-01-27 19:10:51.770168"]]