app/views/categories/_show.html.erb

<ul>
  <% category.todo_lists.each do |todo_list|%>
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."category_id" = $1  [["category_id", 2]]